{
  "desserts": [
    {
      "id": 1,
      "name": "Chocolate Lava Cake",
      "image": "https://preppykitchen.com/wp-content/uploads/2016/03/Chocolate-lava-cake-blog.jpg",
      "favorited": 8,
      "ingredients" : "1/2 cup butter unsalted, 6 oz bittersweet chocolate, 2 eggs, 2 egg yolks, 1/4 cup sugar, 1 pinch salt, 2 tbs flour",
      "recipe" : "1. Preheat oven to 450F. Butter and flour your ramekins. 2. Melt the butter with the chocolate on low heat in a double boiler or in the microwave.  Whisk until smooth. 3. In a medium bowl, beat the eggs with the egg yolks, sugar and salt until thickened and pale. An electric mixer will work best. 4. Fold the chocolate mixture and flour into the egg mixture. Pour the batter into the ramekins and bake at 450 for 6-8 minutes, it really depends on your oven. 5. Let the cakes cool in the ramekins for a minute, then cover each with an inverted dessert plate. Carefully turn each one over, let stand for 10 seconds and then unmold. Sift powdered sugar on top and garnish with berries if desired. Serve immediately.",
      "tags": "All, chocolate"
    },
    {
      "id": 2,
      "name": "Strawberry Cheesecake",
      "image": "https://www.bakedbyanintrovert.com/wp-content/uploads/2018/05/Strawberry-Cheesecake-Recipe.jpg",
      "favorited": 8,
      "ingredients" : "For The Crust: 2 cups (200 g) graham cracker crumbs, about 2 sleeves, ¼ cup (50g) granulated sugar, 6 tablespoons unsalted butter, melted. For The Filling: 32 ounces (904 g) cream cheese, room temperature, 1 ⅓ cups (266 g) granulated sugar, 1 cup (227 g) sour cream, room temperature, 1 tablespoon vanilla extract, ¼ teaspoon salt, 4 large eggs, room temperature, lightly beaten. For The Sauce: 16 ounces (400 g) whole strawberries, diced. 2 tablespoons cornstarch, 1 cup (200 g) granulated sugar, 2 teaspoons vanilla extract, ⅛ teaspoon salt, 2 cups (334 g) finely chopped strawberries",
      "recipe" : "1.  Make The Crust-  Move the oven rack to the lower third position and heat the oven to 350°F. Wrap the outer bottom of a 9-inch springform pan tightly with aluminum foil. 2. Combine the graham cracker crumbs, sugar, and melted butter. Press the crumb mixture into the bottom and about 2-inches up the sides of the pan. Bake for 10 minutes. Set aside to cool while you make the filling. 3. Make The Filling - Reduce the oven temperature to 300ºF. 4. In a large mixing bowl beat the cream cheese with an electric mixer until smooth and creamy, about 1 minute. 5. Add the sugar and sour cream, beat until well combined. Add the vanilla and salt, beat on low speed until smooth. 6. Using a silicone spatula, gently stir in the eggs just until combined. Pour the batter over the prepared crust. 7. Fill a roasting pan with a few inches of boiling water and place the cheesecake in the center. 8. Bake for 1 hour, OR until the edges are set and the center is slightly jiggly. Turn the oven off, leave the cheesecake in the water bath in the oven for another hour. 9. Remove the cheesecake from the water bath and place it on a wire rack. Run a small knife around the outer edge of the cheesecake to loosen it from the pan and leave it to cool at room temperature for about 1 ½ hours. Meanwhile, make the sauce. Alternatively, you can refrigerate the cheesecake for at least 4 hours or overnight after it has cooled and make the sauce about 1 hour before serving. Top the chilled cheesecake with the sauce or top individual slices when ready to serve. 10. Make The Sauce: Add the diced strawberries and cornstarch to the bowl of a food processor and process until smooth. Transfer to a medium saucepan and add the sugar. 11. Cook over medium heat, stirring constantly until thickened, about 15 minutes. 12. Remove from heat and stir in the vanilla, salt, and chopped strawberries. Set aside to cool for about 40 minutes, stirring occasionally. 13. Spread the topping evenly over the cheesecake and refrigerate for at least 4 hours, preferably overnight. Remove the sides of the pan just before serving.",
      "tags": "All, fruit"
    },
    {
      "id": 3,
      "name": "The Best Gluten-Free Chocolate Chip Cookies",
      "image": "https://meaningfuleats.com/wp-content/uploads/2018/06/IMG_1300-768x1152.jpg",
      "favorited": 8,
      "ingredients" : "1 stick butter, ½ cup, 1 tablespoon milk, or almond milk, ¾ cup brown sugar, ¼ cup white sugar, 1 egg, 2 teaspoons vanilla, 1 ⅓ cups gluten-free all-purpose flour, ¼ cup almond flour, 1 ounce, 1 teaspoon baking soda, ½ teaspoon salt, 1 cup chocolate chips, Sea salt for sprinkling, optional",
      "recipe" : "1. In a medium bowl, whisk together the gluten-free flour, almond flour, baking soda and salt until evenly combined. Set aside. 2. Melt butter in a saucepan over medium heat. Once the butter is melted start to whisk constantly. First the butter will begin to foam, then after a couple of minutes it will begin to brown on the bottom of the saucepan. Turn off the heat as soon as the solids turn brown and the butter gives off a nutty aroma. Pour into a glass mixing bowl to prevent burning. 3. Add the milk, brown sugar and white sugar. Whisk to combine. Add the egg and vanilla and whisk until smooth and creamy. 4. Using a rubber spatula, mix in the dry ingredients until well combined. Stir in the chocolate chips. 5. Cover the bowl and let sit for 30 minutes. Preheat the oven to 350F. Scoop the cookie dough (about 2 Tablespoons of dough per cookie) and place a few inches apart on the baking sheets. Bake for 10-12 minutes, until golden and the center is set. 6. Let cool 5 minutes then transfer to a wire rack to continue cooling. Enjoy!",
      "tags": "All, gluten free"
    },
    {
      "id": 4,
      "name": "Healthy Blueberry Cobbler",
      "image": "https://www.erinliveswhole.com/wp-content/uploads/2020/03/BlueberryCrisp-7-1020x1536.jpg",
      "favorited": 8,
      "ingredients" : "Blueberry base: 4 cups fresh blueberries (or frozen), 2 tbsps maple syrup, 1 tbsp lemon juice, 1 tsp vanilla, 1 tbsp arrowroot powder (or cornstarch). Cobbler: 1 cup rolled oats, 1 cup finely chopped walnuts (or other nut), 1 cup almond flour, 1/4 tsp salt, 1/2 cup maple syrup, 1/3 cup coconut oil, melted, 1 tsp vanilla.",
      "recipe" : "1. Preheat oven to 350F. 2. In a large bowl, mix together blueberries, maple syrup, lemon juice, and vanilla. Then add arrowroot starch and toss blueberries. 3. Spoon berries into an 8×8 inch pan, leaving juice in bowl behind. 4. In another bowl, mix together oats, walnuts, almond flour, and salt. 5. Stir in maple syrup, coconut oil, and vanilla until well combined. 6. Spread cobbler topping on top of blueberries until most of the blueberries are covered. 7. Bake in oven for 40-45 minutes or until topping is golden brown. 8. Let cool for 15 minutes before eating. Store leftovers in refrigerator.",
      "tags": "All, vegan"
    },
    {
      "id": 5,
      "name": "Crème Brûlée",
      "image": "https://www.bakedbyanintrovert.com/wp-content/uploads/2021/05/Creme-Brulee-7-1024x1536.webp",
      "favorited": 8,
      "ingredients" : "½ cup (120 ml) milk, 1 ½ cups (360 ml) heavy cream, 2 teaspoons vanilla bean paste, or vanilla extract, ½ cup (100 g) granulated sugar, 5 large egg yolks, granulated sugar for garnish, Fresh berries for garnish",
      "recipe" : "1. Preheat the oven to 325°F. Arrange six 4-ounce ramekins in a 2-inch deep baking dish. Set aside. 2. Add milk, cream, and vanilla bean paste to a medium saucepan and heat over medium-high heat until bubbles appear along the sides of the pan. 3. In a medium bowl, quickly whisk the sugar and egg yolks together. 4. Slowly pour the hot cream into the yolk mixture while whisking continuously until well combined. 5. Strain the mixture through a fine-mesh sieve into a pitcher or large liquid measuring cup. 6. Pour the custard into the ramekins. Place the baking pan with filled ramekins inside the oven. Then, carefully fill the pan with enough hot water to come ⅔ of the way up the sides of the ramekins. 7. Bake 25-30 minutes, just until set. Start checking the custard early. Bake time will vary depending on the thickness and depth of your ramekins. The custard should be set and not soupy with only a small area of jiggle in the center. 8. Carefully remove the baking dish from the oven and allow the ramekins to cool in the water bath. Once the ramekins are cool enough to handle, remove them from the water, cover with plastic wrap, and refrigerate for at least 4 hours or up to 2 days before serving. 9. Just before serving, sprinkle the tops of the custard with an even layer of granulated sugar, then immediately caramelize the sugar with a propane torch or broiler.",
      "tags": "All"
    },
    {
      "id": 6,
      "name": "Bo Peep",
      "image": "http://4.bp.blogspot.com/_OZHbJ8c71OM/Sog43CMFX2I/AAAAAAAADEs/0AKX0XslD4g/s400/bo.png",
      "favorited": 8,
      "ingredients" : "stuff",
      "recipe" : "recipe",
      "tags": "searchable tags"
    },
    {
      "id": 7,
      "name": "Hamm",
      "image": "https://cdn140.picsart.com/244090226021212.png?r1024x1024",
      "favorited": 8,
      "ingredients" : "stuff",
      "recipe" : "recipe",
      "tags": "searchable tags"
    },
    {
      "id": 8,
      "name": "Little Green Men",
      "image": "http://www.pngmart.com/files/3/Toy-Story-Alien-PNG-File.png",
      "favorited": 8,
      "ingredients" : "stuff",
      "recipe" : "recipe",
      "tags": "searchable tags"
    },
    {
      "id": 9,
      "name": "Little Green Men",
      "image": "http://www.pngmart.com/files/3/Toy-Story-Alien-PNG-File.png",
      "favorited": 8,
      "ingredients" : "stuff",
      "recipe" : "recipe",
      "tags": "searchable tags"
    },
    {
      "id": 8,
      "name": "Little Green Men",
      "image": "http://www.pngmart.com/files/3/Toy-Story-Alien-PNG-File.png",
      "favorited": 8,
      "ingredients" : "stuff",
      "recipe" : "recipe",
      "tags": "searchable tags"
    }
  ]
}
